In [1]:
import pandas as pd
import numpy as np

pd.set_option('display.max_columns', 30)
types = {'id': int, 'metrostotales':float, 'metroscubiertos': float}

training_data = pd.read_csv('../../data/TP2/train.csv', dtype = types, usecols=['id','metroscubiertos','metrostotales'])
evaluation_data = pd.read_csv('../../data/TP2/test.csv',dtype = types, usecols=['id','metroscubiertos','metrostotales'])

training_data.head()

/home/mati/.local/lib/python3.7/site-packages/pandas/compat/__init__.py:85: UserWarning: Could not import the lzma module. Your installed Python is incomplete. Attempting to use lzma compression will result in a RuntimeError.
  warnings.warn(msg)
/home/mati/.local/lib/python3.7/site-packages/pandas/compat/__init__.py:85: UserWarning: Could not import the lzma module. Your installed Python is incomplete. Attempting to use lzma compression will result in a RuntimeError.
  warnings.warn(msg)

       id  metroscubiertos  metrostotales
0  254099             80.0           80.0
1   53461            268.0          180.0
2  247984            144.0          166.0
3  209067             63.0           67.0
4  185997             95.0           95.0

In [2]:
training_data[training_data['metroscubiertos']>training_data['metrostotales']].info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 70295 entries, 1 to 239998
Data columns (total 3 columns):
id                 70295 non-null int64
metroscubiertos    70295 non-null float64
metrostotales      70295 non-null float64
dtypes: float64(2), int64(1)
memory usage: 2.1 MB

In [3]:
training_data['mas_mcub_que_mtot'] = training_data['metrostotales'] - training_data['metroscubiertos']
training_data['mas_mcub_que_mtot'] = training_data['mas_mcub_que_mtot'].apply(lambda x: 1 if x < 0 else 0)

evaluation_data['mas_mcub_que_mtot'] = evaluation_data['metrostotales'] - evaluation_data['metroscubiertos']
evaluation_data['mas_mcub_que_mtot'] = evaluation_data['mas_mcub_que_mtot'].apply(lambda x: 1 if x < 0 else 0)

In [4]:
training_data.drop(columns=['metroscubiertos','metrostotales'],inplace=True)
evaluation_data.drop(columns=['metroscubiertos','metrostotales'],inplace=True)

In [5]:
training_data

            id  mas_mcub_que_mtot
0       254099                  0
1        53461                  1
2       247984                  0
3       209067                  0
4       185997                  0
...        ...                ...
239995  119879                  0
239996  259178                  0
239997  131932                  0
239998  146867                  1
239999  121958                  0

[240000 rows x 2 columns]

In [6]:
evaluation_data.to_csv('../../res/ftr/cubiertos_mayor_a_totales_evaluation.csv')
training_data.to_csv('../../res/ftr/cubiertos_mayor_a_totales_train.csv')